let week =  ['星期日','星期一','星期二','星期三','星期四','星期五','星期六']

let month  = ['一月','二月','三月','四月','五月','六月','七月','八月','九月','十月','十一月','十二月']

let weather = {
  //0 day，1 night
  "00":['\ue8de','\ue8ac'],//晴
  "01":['\ue8c0','\ue8b8'],//多云
  "02":['\ue8cd','\ue8e5'],//阴
  "03":['\ue8ae','\ue8b4'],//阵雨
  "04":['\ue8b7','\ue8b1'],//雷阵雨
  "05":['\ue8bf','\ue8c7'],//雷阵雨伴有冰雹
  "06":['\ue8c8','\ue8b3'],//雨夹雪
  "07":['\ue8c6','\ue8d0'],//小雨
  "08":['\ue8ca','\ue8d4'],//中雨
  "09":['\ue8bd','\ue8d3'],//大雨
  "10":['\ue8b9','\ue8c9'],//暴雨
  "11":['\ue8d2','\ue8d5'],//大暴雨
  "12":['\ue8da','\ue8df'],//特大暴雨
  "13":['\ue8dc','\ue8dd'],//阵雪
  "14":['\ue8b5','\ue8d1'],//小雪
  "15":['\ue8db','\ue8c3'],//中雪
  "16":['\ue8e0','\ue8e8'],//大雪
  "17":['\ue8e7','\ue8e6'],//暴雪
  "18":['\ue8a9','\ue8cb'],//雾
  "19":['\ue8b2','\ue8cc'],//冻雨
  "20":['\ue8ba','\ue8d6'],//沙尘暴
  "21":['\ue8ab','\ue8d9'],//小到中雨
  "22":['\ue8ad','\ue8ce'],//中到大雨
  "23":['\ue8b0','\ue8c5'],//大到暴雨
  "24":['\ue8aa','\ue8cf'],//暴雨到大暴雨
  "25":['\ue8d7','\ue8d8'],//大暴雨到特大暴雨
  "26":['\ue8bb','\ue8be'],//小到中雪
  "27":['\ue8e2','\ue8e3'],//中到大雪
  "28":['\ue8e4','\ue8e1'],//大到暴雪
  "29":['\ue8bc','\ue8c4'],//浮尘
  "30":['\ue8b6','\ue8c2'],//扬沙
  "31":['\ue8af','\ue8c1'],//强沙尘暴
  "53":['\ue8ea','\ue8e9'],//霾
}


export {week,month,weather}